# Brewfile - macOS packages
# Install with: brew bundle --file=Brewfile

# Taps (only non-default ones)
tap "homebrew/cask-fonts"

# Core
brew "git"
brew "git-delta"
brew "gh"
brew "curl"
brew "wget"
brew "jq"
brew "yq"
brew "age"
brew "trash"

# Shell
brew "zsh"
brew "starship"
brew "zsh-vi-mode"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Terminal + multiplexer
brew "ghostty"
brew "kitty"
brew "tmux"
brew "tpm"
brew "fzf-tab"

# Editor
brew "neovim"
brew "lazygit"
brew "gitui"

# Modern CLI replacements
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "zoxide"
brew "btop"
brew "yazi"
brew "miller"
brew "sd"
brew "hyperfine"
brew "watchexec"
brew "mprocs"
brew "lazydocker"
brew "dive"
brew "ctop"
brew "bandwhich"
brew "git-absorb"
brew "gitleaks"
brew "pre-commit"

# Network
brew "xh"

# Language toolchains
brew "node"
brew "python@3.13"
brew "rustup-init"
brew "dotnet-sdk"
brew "go"

# Build tools
brew "gcc"
brew "pkgconf"
brew "openssl@3"
brew "cmake"

# Phase 1: shell upgrade tools
brew "atuin"
brew "direnv"
brew "uv"

# Phase 2: dev workflow
brew "just"
brew "bun"
brew "act"

# Gas town / multi-agent orchestrator
# Note: `gt` itself is not yet on homebrew. install-mac.sh runs:
#   go install github.com/gastownhall/gastown/cmd/gt@latest
#   go install github.com/gastownhall/beads/cmd/bd@latest
#   go install github.com/gastownhall/beads/cmd/bv@latest
# `dolt` is the storage backend for beads:
brew "dolt"

# Fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-symbols-only-nerd-font"
